- 기획실 정혜영 차장 요구사항

1. **개발실적 및 개발예측 데이터**
  * 개발실적은 MSTR에서 조회·입력하고 있으나, 월별로 RPA를 통해 입력되는 데이터를 활용할 수 있음.
  * 개발예측 데이터는 데이터분석센터에서 사용하는 **RPA용 개발목표**를 참고하여 작성함.
  * 개발목표예측 실측 데이터는 다음 2개 레포트를 기준으로 확인함.
    * `GNIP10 > 내리포트 > 정혜영 > 개발목표예측 실측입력`
    * `GNIP10 > 내리포트 > 정혜영 > 개발목표예측 실측입력(교육기관지역사회)`

  * `개발목표예측 실측입력(교육기관지역사회)` 레포트는 교육기관 및 지역사회 실측 입력값 확인 용도로 사용함.

2. **개발실적 구분 기준**
  * **해외프로젝트**는 해외구호의 약칭으로 사용하며, 다음 사업을 포함함.
    * 해외교육지원
    * 희망학교지원
    * 보건의료지원
    * 식수위생사업
    * 해외구호개발사업
    * 재난구호사업

  * **본부기타**는 나눔마케팅본부 및 회원실을 제외한 본부 부서를 의미하며, ESG 및 사회공헌협력팀 등을 포함함.
  * **대면부서**는 소셜펀딩부 및 캠페인기획2팀의 실적을 기준으로 산출함.


3. **교육기관 / 지역사회 구분 기준**
  * 부서 기준으로는 **시도본부 및 지부**에 해당하는 실적을 대상으로 하며, 해당 실적을 상위캠페인 기준으로 추가 분류하여 **교육기관**과 **지역사회**로 구분함.
  * **교육기관**에 포함되는 상위캠페인:
    * `U1255` 초등캠페인
    * `U1256` 유아캠페인
    * `U1257` 청소년캠페인
    * `U1197` 2023 희망편지쓰기대회
    * `U1198` 2023 가족그림편지쓰기대회
    * `U1199` 2023 청소년캠페인
    * `U1261` 교육기관(기타)캠페인

  * **지역사회**에 포함되는 상위캠페인:
    * `U0892` 교회캠페인
    * `U0897` 지역사회(기타)
    * `U1105` 대학생캠페인
    * `U1106` 좋은이웃가게
    * `U1107` 신규기획사업
    * `U1204` 국제교류
    * `U1263` 지역네트워크
    * `U1208` 지부개발(사복)
    * `U1104` 디지털마케팅
    * `U0243` 지역사회 네트워크
    * `U1265` 2024_가두캠페인
    * `U1287` 해외결식-Let s begin 캠페인
    * `U0893` 가두캠페인


4. **공휴일 데이터**
  * CRM에서 사용하는 공휴일 정보를 활용하여도 무방함.

5. 연도말_개발예측_양식_부서세분화
    연사업목표 탭 데이터 기준으로 목표치 인입.
    설정탭과 예측 값, 실측값 기반으로 A안 B안 C안 도출

6. 실측입력
    MSTR 집계 방식으로 집계한 데이터를 실측값으로 인입.

7. 해당년도 목표파일 데이터 연초 인입 필요