-- 영상매체 데이터 연동 
-- 과거 데이터 인입. 
-- 영상 광고 상세 CSV 파일을 기준으로 영상 광고 운영 데이터를 VIDEO_AD_CMPGN_DTLS에 적재한다.
-- 지정된 영상 광고 데이터 파일(2024-2026 VIDEO DATA.csv)을 Stage에서 조회하여 데이터를 적재한다.
-- CSV 원천 데이터를 대상 테이블의 컬럼 순서에 맞춰 총 35개 항목으로 매핑한다.
-- 21번째 원천 컬럼인 캠페인 유형 데이터를 캠페인유형1, 캠페인유형2, 캠페인유형 전체 값으로 분리하여 적재한다.
-- 나머지 광고 운영 및 성과 데이터는 원천 컬럼 값을 순서대로 대상 테이블에 매핑한다.
-- 지정된 파일 패턴을 기준으로 대상 파일을 선별하여 영상 광고 데이터를 일괄 적재한다.

COPY INTO GN_DW.BRONZE_AGENCY.VIDEO_AD_CMPGN_DTLS
FROM (
SELECT
    $1, $2, $3, $4, $5, 
    $6, $7, $8, $9, $10, 
    $11, $12, $13, $14, $15, 
    $16, $17, $18, $19, $20, 
    SPLIT_PART($21, ' ', 1), REGEXP_REPLACE($21, '^[^ ]+[ ]*', ''), $21, $22, $23, 
    $24, $25, $26, $27, $28, 
    $29, $30, $31, $32, $33,
    $34, $35
FROM @GN_DW.BRONZE_AGENCY.VIDEO_ADS_FILE
(FILE_FORMAT => 'GN_DW.BRONZE_AGENCY.GN_CSV_FORMAT', PATTERN => '.*2024-2026 VIDEO DATA\\.csv')
)

